<?xml version="1.0"?>
<net name="gqaTest" version="11">
	<layers>
		<layer id="0" name="Q" type="Parameter" version="opset1">
			<data shape="1,32,12,96" element_type="f32" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>12</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="K" type="Parameter" version="opset1">
			<data shape="1,32,12,96" element_type="f32" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>12</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="V" type="Parameter" version="opset1">
			<data shape="1,32,12,96" element_type="f32" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>12</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="total_sequence_len" type="Parameter" version="opset1">
			<data shape="1,1" element_type="i32" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="past_key_values.0.key" type="Parameter" version="opset1">
			<data shape="1,32,1024,96" element_type="f32" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1024</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="past_key_values.0.value" type="Parameter" version="opset1">
			<data shape="1,32,1024,96" element_type="f32" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1024</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="sequence" type="Parameter" version="opset1">
			<data shape="1,1" element_type="i32" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="cos_cache" type="Parameter" version="opset1">
			<data shape="4096,48" element_type="f32" />
			<output>
				<port id="0" precision="FP32">
					<dim>4096</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="sin_cache" type="Parameter" version="opset1">
			<data shape="4096,48" element_type="f32" />
			<output>
				<port id="0" precision="FP32">
					<dim>4096</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="/model/layers.0/attn/GroupQueryAttention" type="GroupQueryAttention" version="extension">
			<data do_rotary="true" kv_num_heads="32" num_heads="32" rotary_interleaved="false" scale="0.10206207633018494" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>12</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>12</dim>
					<dim>96</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>12</dim>
					<dim>96</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1024</dim>
					<dim>96</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1024</dim>
					<dim>96</dim>
				</port>
				<port id="5" precision="I32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="6" precision="I32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="7" precision="FP32">
					<dim>4096</dim>
					<dim>48</dim>
				</port>
				<port id="8" precision="FP32">
					<dim>4096</dim>
					<dim>48</dim>
				</port>
			</input>
			<output>
				<port id="9" precision="FP32" names="/model/layers.0/attn/GroupQueryAttention/output_0">
					<dim>1</dim>
					<dim>12</dim>
					<dim>3072</dim>
				</port>
				<port id="10" precision="FP32" names="/model/layers.0/attn/GroupQueryAttention_cast_to_present.0.key">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1024</dim>
					<dim>96</dim>
				</port>
				<port id="11" precision="FP32" names="/model/layers.0/attn/GroupQueryAttention_cast_to_present.0.value">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1024</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="gqa_result" type="Result" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>12</dim>
					<dim>3072</dim>
				</port>
			</input>
		</layer>
		<layer id="8" name="present.0.key" type="Result" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1024</dim>
					<dim>96</dim>
				</port>
			</input>
		</layer>
		<layer id="7" name="present.0.value" type="Result" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1024</dim>
					<dim>96</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="6" to-port="0" />
		<edge from-layer="10" from-port="0" to-layer="6" to-port="1" />
		<edge from-layer="11" from-port="0" to-layer="6" to-port="2" />
		<edge from-layer="1" from-port="0" to-layer="6" to-port="3" />
		<edge from-layer="2" from-port="0" to-layer="6" to-port="4" />
		<edge from-layer="3" from-port="0" to-layer="6" to-port="5" />
		<edge from-layer="12" from-port="0" to-layer="6" to-port="6" />
		<edge from-layer="4" from-port="0" to-layer="6" to-port="7" />
		<edge from-layer="5" from-port="0" to-layer="6" to-port="8" />
		<edge from-layer="6" from-port="11" to-layer="7" to-port="0" />
		<edge from-layer="6" from-port="10" to-layer="8" to-port="0" />
		<edge from-layer="6" from-port="9" to-layer="9" to-port="0" />
	</edges>
	<rt_info />
</net>
