<?xml version="1.0" ?>
<net name="Less-1_427" version="11">
  <rt_info/>
  <layers>
    <layer id="0" name="Less-1_0" type="Parameter" version="opset1">
      <data shape="1..1024" element_type="i32"/>
      <output>
        <port id="0" precision="I32" names="0">
          <dim>-1</dim>
        </port>
      </output>
    </layer>
    <layer id="1" name="Less-1_1" type="Parameter" version="opset1">
      <data shape="256,1" element_type="i32"/>
      <output>
        <port id="0" precision="I32" names="0">
          <dim>256</dim>
          <dim>1</dim>
        </port>
      </output>
    </layer>
    <layer id="2" name="Less-1" type="Less" version="opset1">
      <data auto_broadcast="numpy"/>
      <input>
        <port id="0" precision="I32">
          <dim>-1</dim>
        </port>
        <port id="1" precision="I32">
          <dim>256</dim>
          <dim>1</dim>
        </port>
      </input>
      <output>
        <port id="2" precision="BOOL">
          <dim>256</dim>
          <dim>-1</dim>
        </port>
      </output>
    </layer>
    <layer id="3" name="Result_28423" type="Result" version="opset1">
      <input>
        <port id="0" precision="I64">
          <dim>256</dim>
          <dim>-1</dim>
        </port>
      </input>
    </layer>
    <layer id="4" name="convert_bool_to_i64_Less-1" type="Convert" version="opset1">
      <data destination_type="i64"/>
      <input>
        <port id="0" precision="BOOL">
          <dim>256</dim>
          <dim>-1</dim>
        </port>
      </input>
      <output>
        <port id="0" precision="I64">
          <dim>256</dim>
          <dim>-1</dim>
        </port>
      </output>
    </layer>
  </layers>
  <edges>
    <edge from-layer="0" from-port="0" to-layer="2" to-port="0"/>
    <edge from-layer="1" from-port="0" to-layer="2" to-port="1"/>
    <edge from-layer="2" from-port="2" to-layer="4" to-port="0"/>
    <edge from-layer="4" from-port="0" to-layer="3" to-port="0"/>
  </edges>
</net>
