<?xml version="1.0"?>
<net name="Conv2dWithTransposeTest" version="11">
	<layers>
		<layer id="0" name="Parameter_10" type="Parameter" version="opset1">
			<data shape="1,3,16,20" element_type="f32" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>16</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Constant_15" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="0" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Transpose_16" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>16</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>20</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Constant_13" type="Const" version="opset1">
			<data element_type="f16" shape="8, 3, 2, 4" offset="32" size="384" />
			<rt_info>
				<attribute name="preprocessing" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="FP16">
					<dim>8</dim>
					<dim>3</dim>
					<dim>2</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Convert_14" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
				<attribute name="preprocessing" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>8</dim>
					<dim>3</dim>
					<dim>2</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>3</dim>
					<dim>2</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Convolution_17" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>20</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>3</dim>
					<dim>2</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>19</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Result_18" type="Result" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>19</dim>
					<dim>13</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="2" to-port="0" />
		<edge from-layer="1" from-port="0" to-layer="2" to-port="1" />
		<edge from-layer="2" from-port="2" to-layer="5" to-port="0" />
		<edge from-layer="3" from-port="0" to-layer="4" to-port="0" />
		<edge from-layer="4" from-port="1" to-layer="5" to-port="1" />
		<edge from-layer="5" from-port="2" to-layer="6" to-port="0" />
	</edges>
	<rt_info />
</net>
