<net name="single_conv" version="10">
  <layers>
    <layer id="0" name="result.1" type="Parameter" version="opset1">
      <data shape="1, 4, 2, 2" element_type="f16"/>
      <output>
        <port id="0" precision="FP16" names="result.1">
          <dim>1</dim>
          <dim>4</dim>
          <dim>2</dim>
          <dim>2</dim>
        </port>
      </output>
    </layer>
    
    <layer id="1" name="BatchNormalization_1/mean/Fused_Mul__copy" type="Const" version="opset1">
      <data element_type="f16" shape="4, 4, 2, 2" offset="0" size="128"/>
      <output>
        <port id="0" precision="FP16" names="nncf_module.conv1.weight">
          <dim>4</dim>
          <dim>4</dim>
          <dim>2</dim>
          <dim>2</dim>
        </port>
      </output>
    </layer>
    <layer id="2" name="Conv_0" type="Convolution" version="opset1">
      <data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
      <input>
        <port id="0" precision="FP16">
          <dim>1</dim>
          <dim>8</dim>
          <dim>8</dim>
          <dim>8</dim>
        </port>
        <port id="1" precision="FP16">
          <dim>8</dim>
          <dim>8</dim>
          <dim>3</dim>
          <dim>3</dim>
        </port>
      </input>
      <output>
        <port id="2" precision="FP16">
          <dim>1</dim>
          <dim>8</dim>
          <dim>8</dim>
          <dim>8</dim>
        </port>
      </output>
    </layer>
    <layer id="3" name="495/sink_port_0" type="Result" version="opset1">
      <input>
        <port id="0" precision="FP16">
          <dim>1</dim>
          <dim>8</dim>
          <dim>8</dim>
          <dim>8</dim>
        </port>
      </input>
    </layer>
  </layers>
  <edges>
    <edge from-layer="0" from-port="0" to-layer="2" to-port="0"/>
    <edge from-layer="1" from-port="0" to-layer="2" to-port="1"/>
    <edge from-layer="2" from-port="2" to-layer="3" to-port="0"/>
  </edges>
</net>
